/**************************************
FindReplaceEx.js - ver. 2013-03-24
Interface language
Language:      Russian (1049)
Translated by: F.Phoenix
**************************************/
sTxtFRTempl     = 'Шаблоны поиска и замены';
sTxtTemplates   = 'Шаблоны';
sTxtName        = 'Наименование';
sTxtFindWhat    = 'Что найти';
sTxtReplaceWith = 'Чем заменить';
sTxtMatchCase   = 'Учитывать регистр';
sTxtWholeWord   = 'Слово целиком';
sTxtRegExp      = 'Регулярные выражения';
sTxtEscSeq      = 'Esc-последовательности';
sTxt1Yes0No     = '(1 = да, 0 = нет)';
sTxtNew         = 'Создать';
sTxtAdd         = 'Добавить';
sTxtEdit        = 'Изменить';
sTxtDelete      = 'Удалить';
sTxtOK          = 'OK';
sTxtClose       = 'Закрыть';
sTxtNameExists  = 'Такое наименование шаблона уже используется.';
sTxtNoName      = 'Необходимо заполнить поле "Наименование".';
sTxtNoFindWhat  = 'Необходимо заполнить поле "Что найти".';
sTxtWantRemove  = 'Вы дейстительно хотите удалить этот шаблон?';
sHlpAnyChar     = 'любой символ (точка)';
sHlpSpecChars   = '()[]{}^$.?+*|\\ специальные символы';
sHlpFF          = 'перевод страницы \\x0C';
sHlpAnyNL       = 'перевод строки';
sHlpTab         = 'табуляция \\x09';
sHlpVTab        = 'вертикальная табуляция \\x0B';
sHlpDigit       = 'цифра [0-9]';
sHlpNonDigit    = 'не цифра [^0-9]';
sHlpWhiteSp     = 'пробельный символ [ \\f\\n\\t\\v]';
sHlpNonWhiteSp  = 'непробельный символ';
sHlpWordChar    = 'словесный символ [A-Za-z0-9_]';
sHlpNonWordChar = 'несловесеый символ';
sHlpCharHex     = 'char - hex code, range 0-10FFFF';            //new
sHlpCharHex2    = 'char - 2-digit hex code';                    //new, instead of sHlpCharHex='character hex code FF'; sHlpCharHex='символ с кодом FF';
sHlpCharHex4    = 'char - 4-digit hex code';                    //new, instead of sHlpUniCharHex='Unicode char hex code FFFF'; sHlpUniCharHex='символ юникода FFFF';
sHlpBeginLine   = 'начало строки';
sHlpEndLine     = 'конец строки';
sHlpBeginText   = 'beginning of text';                          //new
sHlpEndText     = 'end of text';                                //new
sHlpBeginRange  = 'beginning of search range';                  //new
sHlpEndRange    = 'end of search range';                        //new
sHlpWordBoun    = 'граница слова';
sHlpNonWordBoun = 'не граница слова';
sHlpAlternative = 'одна из альтернатив: ab либо xy';
sHlpCharSet     = 'набор символов, нужен любой из них';
sHlpNegCharSet  = 'исключающий набор символов';
sHlpRange       = 'диапазон символов от a до z';
sHlpNegRange    = 'исключающий диапазон';
sHlpCapture     = 'запоминающая скобка';
sHlpNotCapture  = 'незапоминающая скобка';
sHlpPreceded    = 'preceded by ab';                             //new
sHlpNotPreceded = 'not preceded by ab';                         //new
sHlpFollowed    = 'далее следует ab';
sHlpNotFollowed = 'далее не следует ab';
sHlpBackrefer9  = 'обратная ссылка, диапазон 1-9';
sHlpBackrefer99 = 'обратная ссылка, диапазон 01-99';
sHlpZeroOrOne   = '0 или 1 раз';
sHlpZeroOrMore  = '0 или более раз';
sHlpOneOrMore   = '1 или более раз';
sHlpExactly     = 'ровно 3 раза';
sHlpAtLeast     = 'не менее 3 раз';
sHlpFromTo      = 'от 3 до 7 раз';
sHlpBackslash   = 'обратный слеш';
sHlpNL          = 'перевод строки';
sHlpEntireStr   = 'вся захваченная строка';
sHlpSubmatch9   = '9я подстрока (диапазон 1-9)';
sHlpSubmatch99  = '99я подстрока (диапазон 01-99)';
sHlpNonGreedy   = 'все квантификаторы ленивы';